{
	code: "blindbatrickhart",
	category: "villager",
	title: "Blind Bad Rickhart",
	pieces: [
		"Never go into the caves. Never go under the ground. Haven't you heard the story of Blind Bat Rickhart? He was a young boy, just like you lot. Curious, rambunctious, and ready for adventure. Some say he was born in one of the villages around here. 
		
Well there wasn't much to do in the fields for a boy like that. He couldn't be bothered with tilling the soil or gathering wheat. One year, as it came to be harvest season, he decided to slip away while everyone else was working. He knew his father would be furious, but Rickhart was a greedy boy and he wanted his adventure. 

After a long day of traipsing through the heath and forest, young Rickhart had had a great deal of fun, and now the wrath of his father was clear in his mind. He was terrified of going home, so he decided he would stay out for the night and give his father time to calm down and worry about him.

He wasn't very bright, but he wasn't very stupid either. He at least knew better than to be caught roaming about at night. By the time the sun was almost gone, he had stumbled upon a deep, well-hidden cave and decided he would pass the night there. ___NEWPAGE___",



		"Well, the sun went down, and he had himself a nice fire built just near the mouth of the cave. He was safe and hidden there, but the rocky floor was uncomfortable and Rickhart was bored of sitting around. So he decided to play a little game with himself. He would walk into the cave's darkness and see which gave out first: his courage or the cave. 
		
So he started walking deeper into the cave, brushing off all the warnings his parents and elders had given him since he was born. They had always told him that there were dark things under the earth. Darker even than the monsters we see at night. Rickhart was scared, for sure, but that was all the more thrilling for him. He felt himself just getting into the real adventure as he took one step and then another, deeper and deeper. ___NEWPAGE___",


		"His heart beat like a drum on festival night, but he kept going. He was giggling now, thinking how much fun he was having. He was sure it was all just a silly jaunt, but the images of torn flesh, long hairy limbs, and scraping metal started to fill his head. He could hear his grandmother's ragged voice as he remembered all the old stories she'd told him about the Drifters and horrible Groundlings.
		
On the verge of giving up and running, he bumped headfirst into the cave wall. He'd made it to the end. He breathed a sigh of relief, did a small jig to celebrate his victory, and turned to walk back to his warm fire— only, when he took his first step back the ground gave out beneath him. He fell and fell through the earth, scraping and tearing his skin all the way down. ___NEWPAGE___",



		"When he finally came to stop and got a chance to right himself, he was far below the little cave where he had started. Now young, foolish Rickhart had only one thing in mind: he wanted to get home as quickly as he could. That being said, he couldn't see anything in the immense darkness, and he was so disoriented from the fall that he wasn't quite sure which way he'd came from. All he could tell was that he had landed in a large cavern, and that he could only figure out by the echoing sounds of the rocks sliding after him. ___NEWPAGE___",



		"So he started feeling his way around, looking for something, anything to give him some direction. His hands found a rock face, but something was strange about it. The rock was smooth to the touch. He followed it for a couple feet and realized it formed an entire wall of smooth, even rock. There was some kind of wall here, carved into the earth. 
		
Having no other option, Rickhart held his hand to the wall and used it as a guide, walking alongside it, but it led him deeper into the cavern. He followed it for a while, until it suddenly fell away and Rickhart lost his balance, stumbling to the ground. He stood up, and decided to not risk venturing further. He held onto the wall again and tried to walk back to the place where he thought he'd fallen through the dirt. 

Only, after walking a good distance, he found himself somehow further into the cavern, judging by the sound of his footsteps. In his confusion, he reached out into the open darkness beyond the wall... And felt his hands touching another strange, carved stone wall. He realized suddenly that this was some kind of maze, full of walls in the same shape and design; He must have latched onto the wrong wall after falling onto the ground. ___NEWPAGE___",


		
		"He was lost. Trapped under the earth in a dark labyrinth with only his grandmother's horrible stories to keep him company. He suddenly remembered all the warnings he'd been given. Never go underground. There are dark things there. Terrors that you can't understand. Rickhart's skin jumped. He felt eyes on him. These unknown 'things' watching him. Waiting for him. He hears movement. A skittering echoes through the cavern. It's getting closer. 
		
Panicking, Rickhart turned and ran through the maze, stumbling from wall to wall, moving as fast as he could to get away from the skittering. He could still hear it getting closer. He could hear it breathing now, quiet and shrill. He could feel it just behind him. Something large and bristling with hair. He was terrified. He was sure this was the end. ___NEWPAGE___",


		
		"Just then he crashed into something different. It was large, cold, metallic, and did not give when he hit it. Rickhart was pushed back onto the ground from the impact. The skittering stopped. In its place, this large metal thing started to move. 
		
He heard clicking, cranking, stomping, steaming, and other unrecognizable sounds. The thing seemed to be turning about to face him. He was frozen, trying desperately to disappear and somehow wake up in the warm wheat fields and smell his mother's cooking, but instead all he could smell was something like eggs left cracked and burning in the sun. 

The thing stopped moving. Stopped making noises. Just stood there, like a statue. Gathering his wits about him for a moment, Rickhart realized perhaps it hadn't actually noticed him. Just as he was about to crawl away, the thing suddenly shined one huge light in his face. Rickhart screamed.___NEWPAGE___",



		"Two days later, the villagers found him after combing through the forest. He was shaking. Blind in both eyes. Covered in dirt. His hands were torn to shreds. Said he dug his way out. He just chose a direction and started digging. Came out through a nearby hill.  Got lucky, I suppose. They took him home and did what they could to take care of him, but he was never the same after that. His vision never came back. He would still have shaking fits from time to time. It took his family years to finally get him to tell them what happened. They told the rest of the village about it, and the story spread from there. 
		
Sometimes he would tell the story to curious travelers and young children. There was one thing he always said. One thing he always finished his story with. 'Do you remember the giant metal thing I mentioned?' he would say, leaning in close. He'd whisper, 'The thing that shined a light on me? Well, the truth is, it wasn't a light at all. No, not at all. It was an eye, you know. It saw me. Stared into me. I can feel it staring at me all the time. Except when I tell this story. Then it looks away from me. And where do you think it looks instead? I'm sure you'll figure it out.'"
	]
}